Revit 2027 API
ModelPathUtils.CloudRegionEMEA Property
Note: This API is now obsolete.
 The name of cloud region EMEA. This method is deprecated in Revit 2026.3 and may be removed in a later version of Revit. See GetAllCloudRegions to get the list of all available regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute]
public static string CloudRegionEMEA { get; }
<ObsoleteAttribute>
Public Shared ReadOnly Property CloudRegionEMEA As String
	Get
public:
[ObsoleteAttribute]
static property String^ CloudRegionEMEA {
	String^ get ();
}
[<ObsoleteAttribute>]
static member CloudRegionEMEA : string with get
Property Value
String
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace